import Foundation

struct Motivation {
    var days: Int {
        let dateFormatter = DateFormatter()
        dateFormatter.dateFormat = "dd.MM.yyyy"
        let currDate = Date()
        let diploma = dateFormatter.date(from: "18.05.2027")
        let date = Calendar.current.dateComponents([.day], from: currDate, to: diploma!).day ?? 0
        return date
    }
    
    var coolThings: [String] {
        [
            "Это как пробежать марафон \(days / 42) раз — финиш уже близко! 🏃",
            "Успеешь сходить зал целых \(days / 7 * 2 ) раз(-а). Здорово.",
            "Это как накормить \(days * 180) ёжиков по очереди. Круто! 🦔",
            "Это как пересмотреть «Гарри Поттер» \(days / 3) раз(-а). Надо успеть хотя бы раз.",
            "Это как послушать \(days * 24 * 60 / 40) подкастов. Эирподсы куплены не зря!",
            "Это как собрать \(days / 5)",
            "Удачи!",
            "Столько же сантиметров в толщину слой пыли на английксих книжках",
            "Это как сходить на выгулку \(days / 150) раз(-а) составом ЭВМ-23-3",
            "Это как пройти \"Dark Souls III\" \(days * 24 / 33 ) раз(-а). NG+20 ждёт!",
            "Это как разныться о плохой жизни \(days * 24 * (1/2)) раз(-а). Ждём \((days * 24 * (1/2)) + 1).",
            "Это как \(days / 2), только в два раза больше. Магия!",
            "Это на \(days - 67) больше чем 67. Тяжело.",
            "Это как прочесть \"1984\" \(days * 24 / 8) раз(-а). Глубоко.",
            "Это как 1 сессия бротато",
            "Это как послушать все песни макана \(days * 24 / 5) раз(-а).",
            "Это как собрать \(days * 24 / 4) LEGO тысячелетних соколов. Ого.",
            "Это как пройти \"Sekiro\" \(days * 24 / 28 ) раз(-а). Успевай."
        ]
    }
    var icon: [String] {
        [
            "😶‍🌫️",
            "😳",
            "🤯",
            "🥶",
            "🥸",
            "🏀",
            "😱",
            "😃",
            "🥹",
            "🙃",
            "🙂",
            "🤨",
            "🧐",
            "🤩",
            "🫠",
            "🙄",
            "🫨",
            "😲",
            "🫩",
            "😵‍💫",
            "🤮",
            "🤠",
            "🤏",
            "💋",
            "🫦",
            "🦷",
            "👁️",
            "🧌",
            "💅",
            "🌂",
            "🐸",
            "🐽",
        ]
    }
}

